#  Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3) 100 -> 1 (1 + 0 + 0)
a=int(input("Введите трехзначное число: "))
a1=a%10
print(a1)
a2=(a%100)//10
print(a2)
a3=a//100
print(a3)
result =a1+a2+a3
print(result)
